tests/load/artillery.yml
config:
  target: 'http://localhost:5000'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Load test"
    - duration: 60
      arrivalRate: 100
      name: "Spike test"
  
scenarios:
  - name: "User Registration and Login"
    flow:
      - post:
          url: "/api/v1/auth/register"
          json:
            email: "test{{ $randomNumber() }}@example.com"
            password: "password123"
            fullName: "Test User"
            phoneNumber: "1234567890"
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "test@example.com"
            password: "password123"
          capture:
            json: "$.data.tokens.accessToken"
            as: "token"
      - get:
          url: "/api/v1/auth/me"
          headers:
            Authorization: "Bearer {{ token }}"